toasterllc/MDCCode/Code/STM32/Shared/USB.h
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD: {
//            switch (req.bRequest) {
//            case USB_REQ_GET_STATUS:        AssertLED(false);
//            case USB_REQ_CLEAR_FEATURE:     AssertLED(false);
//            case USB_REQ_SET_FEATURE:       AssertLED(false);
//            case USB_REQ_GET_INTERFACE:     AssertLED(false);
//            case USB_REQ_SET_INTERFACE:     AssertLED(false);
//            default:                        break;
//            }
//            break;
//        }}
//        _CmdAccept(false);
        
        
//        AssertLED(false);
//        USBD_EndpointTypeDef *pep;
//        uint8_t ep_addr;
//        USBD_StatusTypeDef ret = USBD_OK;
//        ep_addr = LOBYTE(req.wIndex);
//        
//        switch (req.bmRequestType & Toastbox::USB::RequestType::TypeMask) {
//        case USB_REQ_TYPE_STANDARD:
//            switch (req.bRequest) {
//            case USB_REQ_SET_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                        return;
//                    }
//                
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr != 0x00U) && (ep_addr != 0x80U) && (req.wLength == 0x00U)) {
//                            USBD_LL_StallEP(pdev, ep_addr);
//                            return;
//                        }
//                    }
//                    return _CmdAccept(true);
//                }
//            
//            case USB_REQ_CLEAR_FEATURE:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        (void)USBD_LL_StallEP(pdev, ep_addr);
//                        (void)USBD_LL_StallEP(pdev, 0x80U);
//                    
//                    } else {
//                        _CmdAccept(false);
//                    }
//                    break;
//                case USBD_STATE_CONFIGURED:
//                    if (req.wValue == USB_FEATURE_EP_HALT) {
//                        if ((ep_addr & 0x7FU) != 0x00U) {
//                            (void)USBD_LL_ClearStallEP(pdev, ep_addr);
//                        }
//                        _CmdAccept(true);
//                        AssertLED(false);
//                    //              (USBD_StatusTypeDef)pdev->pClass->Setup(pdev, req);
//                    }
//                    break;
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            case USB_REQ_GET_STATUS:
//                switch (pdev->dev_state) {
//                case USBD_STATE_ADDRESSED:
//                    if ((ep_addr != 0x00U) && (ep_addr != 0x80U)) {
//                        _CmdAccept(false);
//                        break;
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    pep->status = 0x0000U;
//
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    AssertLED(false);
//                    break;
//                
//                case USBD_STATE_CONFIGURED:
//                    if ((ep_addr & 0x80U) == 0x80U) {
//                        if (pdev->ep_in[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    } else {
//                        if (pdev->ep_out[ep_addr & 0xFU].is_used == 0U) {
//                            _CmdAccept(false);
//                            break;
//                        }
//                    }
//                    
//                    pep = ((ep_addr & 0x80U) == 0x80U) ? &pdev->ep_in[ep_addr & 0x7FU] : \
//                    &pdev->ep_out[ep_addr & 0x7FU];
//                    
//                    if ((ep_addr == 0x00U) || (ep_addr == 0x80U)) {
//                        pep->status = 0x0000U;
//                    } else if (USBD_LL_IsStallEP(pdev, ep_addr) != 0U) {
//                        pep->status = 0x0001U;
//                    } else {
//                        pep->status = 0x0000U;
//                    }
//                    
//                    Send(0x80, (uint8_t*)&pep->status, 2);
//                    AssertLED(false);
//                    break;
//                
//                default:
//                    _CmdAccept(false);
//                    break;
//                }
//                break;
//
//            default:
//                _CmdAccept(false);
//                break;
//            }
//            break;
//        
//        default:
//            _CmdAccept(false);
//            break;
//        }
//
//        return ret;
//        
//        _CmdAccept(false);
    }

    static void _SetupRequestHandle(const Toastbox::USB::SetupRequest& req) {
        toaster_printf("_SetupRequestHandle 0x%x 0x%x\n", req.bmRequestType, req.bRequest);
        
        switch (req.bmRequestType & Toastbox::USB::RequestType::RecipientMask) {
        case USB_REQ_RECIPIENT_DEVICE:    return USBD_StdDevReq(req);
        case USB_REQ_RECIPIENT_INTERFACE: return USBD_StdItfReq(req);
        case USB_REQ_RECIPIENT_ENDPOINT:  return USBD_StdEPReq(req);
        }
        AssertLED(false);
        _CmdAccept(false);
    }
    
    struct [[gnu::packed]] CBW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataLength;
        uint8_t  bmFlags;
        uint8_t  bLUN;
        uint8_t  bCBLength;
        uint8_t  CB[16];
    };
    
    struct [[gnu::packed]] CSW {
        uint32_t dSignature;
        uint32_t dTag;
        uint32_t dDataResidue;
        uint8_t  bStatus;
    };
    
