toasterllc/MDCCode/Code/STM32/Shared/USB.h
        toaster_printf("SCSI_Write10-END\n");
    }

    
    
    
    
    
    
    
    
    
    static void TaskEP1() {
        alignas(void*)
        static union [[gnu::packed]] {
            CBW cbw;
            uint8_t _[512];
        } packet = {};
        static_assert(sizeof(packet) == MaxPacketSizeIn());
        static_assert(sizeof(packet) == 512);
        
        Toastbox::IntState ints(false);
        for (;;) {
            T_Scheduler::Wait([] { return _State == State::Connected; });
            
            // XXX: wait for enumeration
            // XXX: why is this necessary?
            // XXX: fixme
            T_Scheduler::Sleep(T_Scheduler::template Ms<100>);
            
            for (;;) {
                const std::optional<size_t> len = Recv(0x01, &packet, sizeof(packet));
                if (!len) break;
                
                AssertLED(*len == sizeof(CBW));
                AssertLED(packet.cbw.dSignature == 0x43425355);
                AssertLED(packet.cbw.bLUN == 0);
                AssertLED(packet.cbw.bCBLength > 0);
                AssertLED(packet.cbw.bCBLength < 16);
                
                #define SCSI_TEST_UNIT_READY                        0x00U
                #define SCSI_INQUIRY                                0x12U
                #define SCSI_MODE_SENSE6                            0x1AU
                #define SCSI_ALLOW_MEDIUM_REMOVAL                   0x1EU
                #define SCSI_READ_CAPACITY10                        0x25U
                #define SCSI_READ10                                 0x28U
                #define SCSI_WRITE10                                0x2AU
                
                const uint8_t lun = packet.cbw.bLUN;
                const uint8_t* cmd = &packet.cbw.CB[0];
                switch (cmd[0]) {
                case SCSI_TEST_UNIT_READY:          return SCSI_TestUnitReady(lun, cmd);
                case SCSI_INQUIRY:                  return SCSI_Inquiry(lun, cmd);
                case SCSI_ALLOW_MEDIUM_REMOVAL:     return SCSI_AllowPreventRemovable(lun, cmd);
                case SCSI_MODE_SENSE6:              return SCSI_ModeSense6(lun, cmd);
                case SCSI_READ_CAPACITY10:          return SCSI_ReadCapacity10(lun, cmd);
                case SCSI_READ10:                   return SCSI_Read10(lun, cmd);
                case SCSI_WRITE10:                  return SCSI_Write10(lun, cmd);
                }
                
                MSC_BOT_SendCSW(packet.cbw.dTag, 0, 0);
            }
        }
    }
    
    static void TaskEP0() {
        Toastbox::IntState ints(false);
        for (;;) {
            T_Scheduler::Wait([] { return _State == State::Connecting || _State == State::Connected; });
            if (_State == State::Connecting) {
                // Update our state
                _State = State::Connected;
                _SetupRequest = std::nullopt;
            }
            
            // Wait for a command
            for (;;) {
                // Wait for a new command to arrive, or for our state to change
                T_Scheduler::Wait([] { return _SetupRequest || _State!=State::Connected; });
                
                // If we're no longer connected, bail and wait to be connected again
                if (_State != State::Connected) break;
                
                // Handle the setup request
                _SetupRequestHandle(*_SetupRequest);
                
                // Consume the command
                _SetupRequest = std::nullopt;
            }
        }
    }
    
    
    
    static void CmdAccept(bool accept) {
        Toastbox::IntState ints(false);
        // Short-circuit if we're not Connected
        if (_State != State::Connected) return;
        _CmdAccept(accept);
    }
    
    static std::optional<size_t> Recv(uint8_t ep, void* data, size_t len) {
        AssertLED(EndpointOut(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return std::nullopt; // Short-circuit if we're not Connected
        
        AssertLED(_Ready(eps));
        _AdvanceStateOut(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceive(&_Device, ep, (uint8_t*)data, len);
            AssertLED(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_PrepareReceiveZeroLen(&_Device, ep);
            AssertLED(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitRecv(*T_Scheduler::template Ctx<_WaitState*>()); });
        if (!ws.ok) return std::nullopt;
        return ws.len;
    }
    
    static bool Send(uint8_t ep, const void* data, size_t len) {
        AssertLED(EndpointIn(ep));
        _EndpointState& eps = _EndpointStateGet(ep);
        
        Toastbox::IntState ints(false);
        if (_State != State::Connected) return false; // Short-circuit if we're not Connected
        
        AssertLED(_Ready(eps));
        _AdvanceStateIn(ep);
        
        if (len) {
            const USBD_StatusTypeDef us = USBD_LL_Transmit(&_Device, ep, (uint8_t*)data, len);
            AssertLED(us == USBD_OK);
        
        } else {
            const USBD_StatusTypeDef us = USBD_LL_TransmitZeroLen(&_Device, ep);
            AssertLED(us == USBD_OK);
        }
        
        _WaitState ws = { .ep = ep };
        T_Scheduler::Ctx(&ws); // Set current task's context, which we'll retrieve from the Wait() lambda
        T_Scheduler::Wait([] { return _WaitSend(*T_Scheduler::template Ctx<_WaitState*>()); });
        return ws.ok;
    }
    
    static void ISR() {
        ISR_HAL_PCD(&_PCD);
    }
    
private:
    static uint8_t _USBD_Init(uint8_t cfgidx) {
        toaster_printf("_USBD_Init\n");
        
        // Open endpoints
        for (uint8_t ep : T_Config::Endpoints) {
            if (EndpointOut(ep)) {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeOut());
                _Device.ep_out[EndpointIdx(ep)].is_used = 1U;
            
            } else {
                USBD_LL_OpenEP(&_Device, ep, USBD_EP_TYPE_BULK, MaxPacketSizeIn());
                _Device.ep_in[EndpointIdx(ep)].is_used = 1U;
            }
            
            // Reset endpoint state
            _EndpointStateGet(ep) = {};
        }
        
        _State = State::Connecting;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_DeInit(uint8_t cfgidx) {
        toaster_printf("_USBD_DeInit\n");
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Suspend() {
        toaster_printf("_USBD_Suspend\n");
        _State = State::Disconnected;
        return (uint8_t)USBD_OK;
    }
    
    static uint8_t _USBD_Resume() {
        toaster_printf("_USBD_Suspend\n");
        _State = State::Connected;
        return (uint8_t)USBD_OK;
    }
    
//  USBD_StatusTypeDef ret;
//
//  USBD_ParseSetupRequest(&pdev->request, psetup);
//
//  pdev->ep0_state = USBD_EP0_SETUP;
//
//  pdev->ep0_data_len = pdev->request.wLength;
//
//  switch (pdev->request.bmRequestType & 0x1FU)
//  {
//    case USB_REQ_RECIPIENT_DEVICE:
//      ret = USBD_StdDevReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_INTERFACE:
//      ret = USBD_StdItfReq(pdev, &pdev->request);
//      break;
//
//    case USB_REQ_RECIPIENT_ENDPOINT:
//      ret = USBD_StdEPReq(pdev, &pdev->request);
//      break;
//
//    default:
//      ret = USBD_LL_StallEP(pdev, (pdev->request.bmRequestType & 0x80U));
//      break;
//  }
//
//  return ret;
    
